charliermarsh.ruff
enkia.tokyo-night
esbenp.prettier-vscode
ics.japanese-proofreading
james-yu.latex-workshop
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
pkief.material-icon-theme
yzane.markdown-pdf
yzhang.markdown-all-in-one
